/******************************************************************************
	项目名称	：E600G车载终端项目
	文件		：net.h
	描述		：
	版本		：0.1
	作者		：pengrui
	创建日期	：2016-10-25
******************************************************************************/

#ifndef NET_H_
#define NET_H_
/*************************************************
  宏定义
*************************************************/
#define 	MAX_BUF_LEN			2048
#define 	NET_BLOCK			0           //阻塞方式
#define 	NET_NONBLOCK		0xff		//非阻塞方式
/*************************************************
  API
*************************************************/
/******************************************************************************
*	函数:	net_ip_get
*	功能:	获取IP
*	参数:
			ipaddr			-	IP地址(返回),4字节
*	返回:
			= 0				-	成功
			<0				-	失败
*	说明:	获取IP地址
******************************************************************************/
int net_ip_get(char *ifname,uint8_t *ipaddr);
/******************************************************************************
*	函数:	net_udp_init
*	功能:	UDP初始化
*	参数:
			port 			-	UDP端口号
			timeout			-	发送接收阻塞模式下超时时间
*	返回:
			>0				-	成功  返回UDP的socket号
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口错误
			-ERR_BUSY		-	已断开

*	说明:	无
******************************************************************************/
int net_udp_init(uint16_t port, uint8_t *localip,uint16_t timeout);
/******************************************************************************
*	函数:	net_udp_send
*	功能:	UDP发送数据
*	参数:
			sockfd 			-	UDP端口号
			buf				-	数据缓冲区
			length			-	要发送数据长度
			ip				-	目标IP地址,4字节
			port			-	目标端口号
*	返回:
			>0				-	成功发送数据字节数
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口错误
			-ERR_BUSY		-	已断开

*	说明:	无
******************************************************************************/
int net_udp_send(int sockfd, uint8_t *buf, uint16_t length, uint8_t *ip, uint16_t port);
/******************************************************************************
*	函数:	net_udp_recv
*	功能:	UDP接收数据
*	参数:
			sockfd 			-	UDP端口号
			buf				-	数据缓冲区(返回)
			max_length		-	数据缓冲区最大长度
			length			-	实际接收数据长度(返回)
			ip				-	源地址IP地址(返回)
			port			-	源地址端口号(返回)
*	返回:
			0				-	成功
			-ERR_SYS		-	系统错误
			-ERR_INVAL		-	接口错误
			-ERR_BUSY		-	已断开

*	说明:	无
******************************************************************************/
int net_udp_recv(int sockfd, uint8_t *buf, uint16_t max_length, uint16_t *length, uint8_t flag, uint8_t *ip, uint16_t *port);
/******************************************************************************
*	函数:	net_udp_close
*	功能:	关闭udp连接
*	参数:
			sockfd 			-	UDP端口号
*	返回:
			无

*	说明:	无
******************************************************************************/
void net_udp_close(int sockfd);

#endif /* NET_H_ */
