/******************************************************************************
	项目名称	：E600G车载终端项目
	文件		：cv_drv_uart.h
	描述		：
	版本		：0.1
	作者		：pengrui
	创建日期	：2016-10-25
******************************************************************************/

#ifndef CV_DRV_UART_H_
#define CV_DRV_UART_H_

#include "cv_cms_def.h"
/*************************************************
  宏定义
*************************************************/
//串口操作模式
#define COMPORT_MODE_NORMAL		0		//正常模式
#define COMPORT_MODE_485		1		//485模式
#define COMPORT_MODE_7816		2		//ISO7816模式
#define COMPORT_MODE_IRDA		3		//远红外模式
//校验方式
#define COMPORT_VERIFY_NO		0		//无校验
#define COMPORT_VERIFY_EVEN		1		//偶校验
#define COMPORT_VERIFY_ODD		2		//奇校验
//清缓冲区模式
#define COMPORT_FLUSH_ALL		0		//清读写缓冲区
#define COMPORT_FLUSH_RD		1		//清读缓冲区
#define COMPORT_FLUSH_WR		2		//清写缓冲区
//RTSCTS流控应用模式
#define COMPORT_RTSCTS_DISABLE	0		//不应用
#define COMPORT_RTSCTS_ENABLE	1		//应用
/*************************************************
  结构类型定义
*************************************************/


/******************************************************************************
*	函数:	drv_uart_open
*	功能:	打开串口设备
*	参数:
			无
*	返回:	0				-	成功
			-ERR_SYS		-	错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化
*	说明:	无
 ******************************************************************************/
int drv_uart_open(void);
/******************************************************************************
*	函数:	drv_uart_cfg
*	功能:	配置串口设备参数
*	参数:
			cfg				-	串口配置信息
*	返回:	0				-	成功
			-ERR_SYS		-	错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化
*	说明:	无
 ******************************************************************************/
int drv_uart_config (comport_config_t *cfg);
/******************************************************************************
*	函数:	drv_uart_send
*	功能:	串口发送数据
*	参数:
			buf				-	数据指针
			len				-	数据长度
*	返回:
			>0				-	成功发送的字节数
			-ERR_SYS		-	错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化
*	说明:	无
 ******************************************************************************/
int drv_uart_send (uint8_t *buf, uint16_t len);
/******************************************************************************
*	函数:	drv_uart_recv
*	功能:	读取串口设备数据
*	参数:
			buf				-	数据指针
			len 			-	数据长度
*	返回:
			> 0				-	成功接收到的串口数据字节数
			-ERR_SYS		-	错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化
*	说明:	无
 ******************************************************************************/
int drv_uart_recv (uint8_t *buf, uint16_t len);
/******************************************************************************
*	函数:	drv_uart_close
*	功能:	关闭串口设备
*	参数:
			无
*	返回:
			0				-	成功
			-ERR_SYS		-	错误
			-ERR_INVAL		-	参数无效
			-ERR_NOINIT		-	没有初始化
*	说明:	无
 ******************************************************************************/
int drv_uart_close (void);
#endif /* CV_DRV_UART_H_ */
